"""Задача 34:  Винни-Пух попросил Вас посмотреть, есть ли в его стихах ритм. 
Поскольку разобраться в его кричалках не настолько просто, насколько легко он их придумывает, Вам стоит написать программу. 
Винни-Пух считает, что ритм есть, если число слогов (т.е. число гласных букв) в каждой фразе стихотворения одинаковое. 
Фраза может состоять из одного слова, если во фразе несколько слов, то они разделяются дефисами. Фразы отделяются друг от друга пробелами. 
Стихотворение  Винни-Пух вбивает в программу с клавиатуры. В ответе напишите “Парам пам-пам”, если с ритмом все в порядке и “Пам парам”, если с ритмом все не в порядке

*Пример:*

**Ввод:** пара-ра-рам рам-пам-папам па-ра-па-да    
    **Вывод:** Парам пам-пам"""


#my_text = "парам пам-пам парам"
my_text = str(input("Введите фразу: "))

my_text_new = my_text.split() 

count_vowels = lambda x: [sum(x in 'уеыаоэяию' for x in word)
    for word in x]

result = count_vowels(my_text_new)

if len(set(result))>1:
    print("Пам парам")
else:
    print("Парам пам-пам")




